Revit 2024 API
SymbolTypeId.DegreeC Property
 Symbol °C, indicating unit Celsius.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId DegreeC { get; }
Visual Basic
Public Shared ReadOnly Property DegreeC As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DegreeC {
	ForgeTypeId^ get ();
}
See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace